{"pages":[{"title":"About Me","text":"About Me TODO : Write an about section.","tags":"pages","url":"fightfil.github.io/pages/about.html"},{"title":"The Penultimate Step","text":"This summer, I found a ton of fun webcomics: OMG ! Check, Please! , Rain , and many more, and I felt that I needed to try my hand at making a similar style of story. The Penultimate Step is about Ellie Carver, a transgender High Jumper at a fictional engineering school in southern Connecticut. Go Thunderbirds! Read the first chapter here . If you're returning to the site, go here for the latest chapter . Characters As far as characters go, TPS is my most ambitious project to date. It has a ton of characters. Here are some of the more important characters that you'd have met so far as you read along. Ellie Carver Ellie is the primary protagonist of this story. Born in Rockport, ME , (as Ethan) she's battled her gender identity all through middle and high school. After coming out to her high school during her graduation, she starts all over again as a track and field athlete at the ISTU . Kyle Talbott Kyle is one of Ellie's suite-mates, from Boulder, CO . Diane Mesker From Glastonbury, CT , Diane's twin sister, Kellen, also attends the ISTU . Diane plays basketball for the school. Theo Welk The son of the founder of Welk Enterprises, a tech transnational out of Stamford, CT , Theo was in a band in high school, but felt abandoned when his friends chose to push him away as they were accepted to different colleges. Jen Lyeford From Poughkeepsie, Jen's mom is a History professor at Marist. Howard Lyons Senior, sprinter, silly. Howard is the RA for Ellie's floor, and was one of the guides during Ellie's recruitment as an athelete before her freshman year. Settings Being a project set in a mostly truthful mirror of the real world, there aren't as many entirely new places and things to review, but I do have to work harder to fit them into the story's world. The Igor Sikorski Technical University The Igor Sikorksy Technical University ( ISTU ) is a private research university in Orange, Connecticut, focusing on engineering sciences and other applied disciplines. Founded in 1978 in Orange, the ISTU was founded by the then CEO of United Technologies, which was the parent company of Stravinsky Aircraft. The company was in the midst of diversifying into high tech fields outside their original field of aerospace. United Technologies founded the school in the hopes of creating a talent incubator to source engineers from. History United Technologies bought the 176-acre plot of land that the university now lies within because of its proximity to Yale's West Campus, and the inability to acquire anything within either New Haven or West Haven. In 1976, the Corporation's board of directors voted narrowly to create the university, and its funding was controversial through the early years of the institution, when student tuitions, grants, and endowments were unable to independently support it. The first buildings were built later that year (Goodfellow Hall, The Xavier Center, and Slocum Laboratories), and the initial faculty were hired in time to start recruiting students for the 1978-79 academic year. Around 60% of its early graduates started working directly for United Technologies but in 1990, the institution determined that it could be financially independent and the board voted to oust the current university president, who was a representative of United Technologies. The new president worked to further expand, and especially round out the university's offerings. Between 1990 and 2000, the university grew drastically in size as new majors were added, the humanities department was fleshed out and new constructions added academic buildings and dorms. Aggressive marketing and outreach programs started attracting potential students from around the country and world. Today, its graduate program is completing its own expansion phase. Graduate degrees are primarily granted in its three primary engineering fields, aerospace, mechanical, and robotics engineering. Campus The ITSU Campus is a gated campus off Marshal Hill Road in Orange. With a main road that goes eastward down to Indian Lake, where it loops back on itself, the campus is divided into northern and southern halves. Buildings on the ITSU campus are built with a blend of modern and gothic architectural styles. The imposing gothic stone- and brick-work is contrasted by large windows and open spaces. The oldest parts of campus were built close to the lake. These buildings are now underclassmen dormitories, the Mathematics department, General sciences, and the main humanities building. Also located on the west side, are the auditorium and concert hall and competitive gymnasium. Academics The ISTU specializes in engineering and the applied sciences, but also has a general liberal arts major for those who attend the university, but decide that neither engineering nor the sciences are right for them. One key feature in the academic plan at the ISTU is that students are expected to choose a focus, or concentration, for their major. A computer science student might, for example, choose to focus on Security, or Artificial Intelligence, and be required to take several classes in that specific field. But that student might instead to focus on Aerospace, or Biotech, and then that would shape their degree by requiring them to take several classes that would otherwise be outside their major. The academic year is split into three trimesters, the first lasting from the first week of September to Thanksgiving. The second trimester starts after the new year, and the third trimester lasts from after spring break in the middle of March to Memorial Day weekend. There is also a summer term, but most students opt to either pursue summer internships, co-ops, or study abroad programs during that term. Borrowing from the WPI Plan, the ISTU also implements a project-based curriculum. However, the ISTU requires that all projects be with a domestic project center—global project are discouraged. The ISTU requires that all engineering students complete a humanities project in their chosen humanities concentration, as well as a senior capstone project in their major field. Students may count co-op work towards this project requirement, provided that they can properly document and present their project, and that said project can find approval from the department's advisors. Thus students may be able to earn money while finishing up this degree requirement. Rankings and Reputation Being a much newer school than top-tier engineering schools like WPI , RPI , and MIT , the ISTU hasn't developed the same type of notoriety as those more famous east coast engineering universities. However, most rankings, especially in regards to return on investment (the ISTU has a tuition about 30% lower than any of these schools), tend to place the school very much on par with the Big 3. Its undergraduate acceptance rate is just under 35%, with about 3800 applicants per year. The first year class averages around 550 students, (which is a very high 42% committal rate), so the school is very adept at finding the students who will end up going there in both the application phase and the admission phase. Student Life The ITSU campus is made up of a geographically and demographically diverse set of students, while still maintaining a strong focus on domestic students, rather than attracting as many international students as schools like MIT or Yale. Unlike many engineering schools, it holds creating a gender balance in the highest priority, and even had a makeup of 52% women for the class of 2014. Overall, however, the balance is closer to 46% women, which still is abnormal in comparison to many other technical universities. There are just under one hundred fifty officially sanctioned clubs on campus, focusing on areas ranging from club sports like Fencing and Ultimate Frisbee, to Student Professional Societies, to community service and outreach clubs. All students are guaranteed housing throughout all four years. 95% of freshman, and 85% of upperclassmen choose to avail themselves of the on-campus housing options, Athletics Other Opportunities Alumni Faculty Meta-info Here's where I explain the reasons for creating each part of the university. I discuss why I chose Orange, CT among other things.","tags":"penultimate-step","url":"fightfil.github.io/pages/penultimate-step/index.html"},{"title":"Sea Songs","text":"Sea Songs is about an idyllic summer camp on a Maine island where aspiring writers, actors, and artists of all varieties can spend the summer learning from each other, building connections, and talking with some of the high flyers in each of their fields, all while enjoying top-notch hospitality. Except, as is often true, when main character Rebekah Coombs is gifted a summer there, she discovers that the secretive program has many hidden truths. Enjoy the ride as you accompany Rebekah on her surprise journey into a world that is about as far from ordinary as it appears. Watch as the aspiring screenwriter is thrust into what could easily have been a film. Read the first chapter here . Returners, get the latest chapter here Characters As with all of my projects, this page will serve as a landing point for you to find out about the world and people of the story in ways that will never make it into the chapters. Here are the characters of Sea Songs : Rebekah Coombs Rebekah is from Reading, Pennsylvania, where the monopoly location inspired 6 year-old Rebekah to write her first script. As she grew, her intrest in writing and film grew with her, and she enrolled at Moriavian College to study Creative Writing and Film after high school. This ordeal starts when she recieves a letter after the end of her sophomore year, inviting her to this summer program for the creative arts. Settings Like The Penultimate Step , Sea Songs is set in a present-day, basically real, version of our own world. So therefore, it's settings are mostly real, except for a few. The Sea School The Sea School of Creativity is a fairly secretive institution. Located on a Maine island a few miles out towards the sea.","tags":"pages","url":"fightfil.github.io/pages/sea-songs.html"},{"title":"The Voltun Collection","text":"Voltun is less of a single story but a world in which a number of my stories exist. The current incarnation of Princess of the Insane actually is technically a Voltun story, but the main things that I'm working on in this world is the story of Zephra Helmb, which is, as yet, untitled. Princess of the Insane Princess of the Insane is a project I started in my junior year of high school, during a mystery novel program at school. We read a bunch of early 20 th century mysteries, a lot of Sherlock Holmes, Hercule Poirot, Miss Marple, etc. Part of the class was to create our own mystery story. So I wrote my first draft of Princess. It was pretty bad, but was the longest project I had written to date, weighing in at 22k words. I liked the ideas, even if my execution was terrible, so I rewrote it over the next 3 years. By the middle of Sophomore year at university, the rewrite hit the 45000 word mark, but I really had no Idea of where I was going to go from there, so I put it on the backburner and started trying other things. Zephra Helmb","tags":"pages","url":"fightfil.github.io/pages/the-voltun-collection.html"},{"title":"Sea Songs - 1","text":"Introduction It was a letter. No one sent letters anymore. Especially not to poor liberal arts students working 8 hours a day just to keep ahead of her rent while burying herself in insurmountable student loans to pay for her degree. But I was staring at a real, honest-to-goodness, letter. 44 Gorham Road Brooklin, ME 04616 Miss Rebekah Coombs 12 Lighthouse Road, Apt 16 Bethlehem, PA 18018 The handwriting addressing it—and it was hand-addressed—was flawless, round, and entirely unremarkable, not a flourish in sight. The heavy paper envelope was, obviously, not one from Staples, sold by the hundred. So with some guilt about mutilating so fine an envelope, I tore it open, revealing 3 equally heavy, equally fine sheets of stationary. Dear Rebekah, I may take the liberty of calling you Rebekah, I hope. You do not know me and, for now, I wish to keep it that way. No matter, for what I am about to tell you does not require you know anything about me. I happened upon one of the stories you wrote for the Moravian Literary Journal this past year and have since become interested in your success. To that end, I am offering you a scholarship to the Sea School of Creativity's summer program. I don't know if you know of it, but the Sea School is one of the most prestigious clubs of actors, writers, artists, and the like in the world. Each summer, they open their estate to a program that lasts for most of the summer, run by some of the leading members of each of those disciplines. You will gain many skills and connections I'm sure you will find useful down the road. My heart was racing. I'd barely made it through the first half a page. Conflicting thoughts and emotions tore at my consciousness. It seemed to good to be true: A summer spent on an idyllic estate where I only had to focus on my writing and hobnobbing with some of the best in the business? With no other worries, I wouldn't need to pay for what would surely be an obscene tuition? But I had never heard of any of it before, and I had no information about whoever wrote this letter. What if this whole thing was some predatory trap? Who cared if it was a trap? Even if it was legit and even if I wouldn't have to pay a cent all summer, I still couldn't afford to go. I had rent to pay, loans to keep up on, and school to save for. I was going to have to work two jobs this summer just to keep up with it all. Just my copyediting gig at the local newspaper wasn't going to be enough to allow me to afford my books this year. Now I wanted to go away and do nothing for the summer? Who the fuck was I kidding? I made to throw the letter into the garbage bin, but hesitated just long enough for my curiosity to force myself to keep reading. I understand that I can't just ask you to uproot yourself for the summer and go to this program, abandoning whatever plans you had already made without some some sort of real compensation. That is why I've attached a hint of what awaits you if you choose to follow my plans. Confused at this, I glanced at the other two pages, and saw that one of them was folded around something. Unfolding it, I beheld a check—for \\$5,000. Dumbfounded, I returned to the letter: You will earn \\$10,000 in hard cash for participating, as well as some other benefits that I cannot tell you about at this time. The following pages outline instructions for being enrolled in the program and how to contact my associates if you need something. Cheers, Your Anonymous Benefactor The other two pages were boilerplate introductions to the program, as well as instructions on how to make my way to a pickup location. But the last few lines, handwritten—an afterthought—almost made me drop the paper. Now, disregard all of the generic instructions about pickup, etc. You won't have to worry about that, as a direct pickup has been arranged for you. On June 11, at 3:30 PM EST , a town car will pick you up at your apartment. It was 2:45. The date was June 11 th . \"Bastard!\" I swore, not even noticing that I spoke aloud, despite my lack of company. He'd planned it this way, With not even 45 minutes between receiving the letter and the time to leave, normally I would probably have decided that it must have been for the best that I wouldn't have any opportunity to prepare, and thus I couldn't go. But this benefactor had headed that possibility off. Now that there was someone coming to pick me up, there was no other valid course of action for me. I couldn't very well refuse the driver when they were nice enough to pick me up at my door. My equivocating cost me 3 of my remaining minutes. 42 left. So much to do. I had to prepare to spend 11 weeks away from my apartment, my home. What the hell do I wear when I go hobnobbing with these celebrity writers and actors? My usual wardrobe of anime-themed t-shirts and jeans or yoga pants sure as hell wouldn't cut it. I ran into my bedroom and started frantically throwing my best outfits into my duffel bag. A mediocre evening gown, two suits, and a sundress was the best I could manage. I tossed a few of my normal shirts and jeans in to be safe, and then barely remembered my underclothes. Bras, both normal and sport flew into the bag, followed by panties, and even a few thongs. Who knows, you might find someone interested in that type of thing. I snorted, deriding that line of thinking. My hand fell on something hard. My vibrator, I saw, looking. Before I could second guess myself, I threw it in. Then I moved to the bathroom. I collected all my toiletries: A toothbrush, the electric razor, the manual one, 2 tubes of toothpaste, shampoo, conditioner, lotion, soap, tampons, pads. Back in the main room of my tiny studio, I grabbed my laptop, phone, accompanying cables, my headphones and a backup set of earbuds, and my notebook. Then I tossed in a few pens and pencils. I looked longingly at my home theater, already missing the sweet bliss of hours lost to anime or Netflix. But it wouldn't fit in my bag, and this ‘idyllic Maine island' probably didn't have cell service, let alone WiFi. Struggling, I forced the zipper on my duffel shut. All that stuff took up more room than I had expected. I looked at my phone: 4 minutes to go. I shouldered my backpack, hefted the duffel, and headed to the door. Sweating, with my hand on the handle, I remembered I needed to grab my purse. Thankfully, I'd left it on the hutch, right by the door. I snagged it and stepped outside. I placed my duffel on the sidewalk, and then hurry back to the door, fumbling around in my purse, searching for the key. Getting it, I turned it in the lock. With that, I'd fully committed myself to this foolhardy lark. A dark blue Model X swung around the bend, coming to an effortless stop in front of my door. A tall woman in a gold coat stepped out the passenger door. Gliding over to me, she took my bags. \"We have one more pickup to do before we can get you to the boat. I hope that isn't a problem.\" \" No problem at all,\" I force myself to say. I was still reeling from the suddenness of this situation and couldn't get myself to focus properly. This was all so weird, like something out of a trashy romance novel—and a bad one at that. I could barely wrap my head around the intricacies of this scholarship, let alone offer up enough brain power to manage to be unfailingly civilized and polite. I walk to the proffered seat in the back of the car and flop gracelessly into it. As soon as I fumble my way to securing the seatbelt around me, we're off. The luxury car is every bit as smooth and easy to ride in as all those rich people who could afford to be early adopters were saying. I barely noticed we're moving as the car winds it's way through the streets of Bethlehem. But before I knew it we were on the highway, headed east on I-78 towards the coast. Pennsylvania soon becomes New Jersey and, merging onto 287, we are hurtling towards New Brunswick. It's nearly five in the afternoon when we reach the pickup location—the historic Queens' Campus of Rutgers University. Standing on the side walk wearing a boater hat and a fucking monocle , was a man I immediately recognized. Nigel Jackson was an indie film director of some repute—that is he actually had the barest name recognition outside of film circles—and one of my inspirations to get into screenwriting. My mouth agape, I couldn't help but stare as one of my heroes was given the same treatment as I had received barely an hour earlier. As the concierge stored his bags, I him in: his hard, angular, jawline, broad shoulders, and bulky arms suggested more of an athlete than the stereotypes for people in our profession would represent. His tailored suit made no effort to hide the effect his bulging pectorals had on his profile. I was so engrossed by him that I hadn't noticed that he'd sat next to me until, once the car was moving again, he asked, \"Would you stop ogling me long enough for me to introduce myself, please? It's fairly disconcerting.\" I shook myself. \"Nigel Jackson does not need introducing in my company.\" God, that sounded far worse than it did in my head. \" That's a rare thing, but now you have me at a disadvantage: How about you introduce yourself?\" But without pausing long enough for me to respond, he starts, \"Getting concierge to this is no small feat, so you must be someone important. But, no, if you were someone important, I'd surely recognize you, or at least, you'd have been somewhat offended that I didn't. So, you're related to… No, know important people. But you're far too doe-eyed around me to have been used to hobnobbing with important people all the time, so you must be one of the benefactees.\" \" My name is Rebekah Coombs and…\" I started the moment he takes a breath, but I got cut short when he started talking again. \" So, Rebekah, what kind are you,\" he mused. \"You're no actor, that's as plain as day. You don't seem to have a fleck of paint anywhere, so I refuse to believe you're a painter…\" He trailed off, obviously continuing his train of thought non-verbally. So I answer his question, \"I do screenwriting and also will sometimes put out out a short story, when the mood takes me.\" \" That explains it then! You're a screenwriter. It all makes sense now.\" With that, he fell silent again, going elsewhere with his thoughts. I pointedly look everywhere but him—still hung up on his first comment. As the drive continued, I tried asking a few questions about his work. They sparked a bit of meaningful discussion, but nothing really breaching the surface. Not 20 minutes later, the car pulled up to the docks. \"When you board,\" the driver said. \"You'll be shown to your cabin. We'll worry about your luggage, so you don't have to.\" The falcon doors opened upwards and I followed Jackson down the pier to the launch.","tags":"Sea Songs","url":"fightfil.github.io/sea-songs-1.html"},{"title":"TPS - Chapter 2","text":"The second day of Orientation starts early. Fuckface—I mean the RA , Howard—serenades everyone with a terrible rendition of Beyoncé at like five a.m. (it was 7:30). Then we all split up for these \"Freshman Prep\" sessions for each of our classes this term. These are little more than syllabus readings, with the teachers—I mean professors—trying to eliminate all ambiguity about what is expected of us. We all meet back up for lunch and after, Fuckface leads the hall in some ice-breaker activities, you know, games like When the West Wind Blows… and such. Once we tire of that, everyone starts to do their own thing. A few games of Ultimate break out on the quad, a few people try to organize a pickup game of football, the works. I join in with the Frisbee people—I played a little bit at Exeter (only during the offseason, I would tell my coach). We start by just throwing the disc around, and some of us definitely take the opportunity to show off. A bad throw sails high over my head, probably twelve feet in the air. Turning, I take three steps into a running bound where I reach as high as I can. I meet the disc at my apex, my outstretch hand snatching the hard plastic, now about a foot lower than before. As I descend, twist in the air and send a backhand towards a girl across the circle from me. It's off by a fair margin, but flies flat and true. I catch my landing with my hand, saving my knees by distributing the weight to a third limb. Five minutes later, another dude one-ups my big leap by throwing an accurate forehand, mid-backflip. The inverted disc rockets towards Theo, who—in awe of the feat—fumbles the catch. Eventually, enough people are interested to start a true game of Ultimate. Backflip kid and the person who brought the Disc are captains, picking playground-style. But while they argue about who should pick first, I check my phone. The first thing I notice is the time: 3:48. I'm very nearly late to the first Captain's Practice for the track team. Since there are limits as to when coaches can provide instruction to their athletes, specifically that they need to wait until October to coach winter sports like Indoor Track, the captains run practice autonomously until the coaches can step in. So I take off, back to my room. Since we hadn't left the quad near the dorm, I didn't have to run far. Thankfully, I am already in decent clothes. I grab my training shoes, as well as my spikes, my water bottle, and a towel. Shoving them into my backpack, I take off running. The one place whose exact location on campus I remember from my recruitment visit is the track, so my strides are fast and true. I whip out of the dorm, swinging off the door frame to keep as much momentum as possible. I continue, running down the main road. Quickly, I turn the corner to the track and vault the fence, skidding to a stop in front of the rest of the team. \" Now that we're all here, let's get to know each other,\" a tall girl with wavy brown hair starts. \"I'm Michaela, I'm a senior, an APO brother, and I'm a Chemical Engineering Major. I'm the Captain for the jump squad and I only High Jump.\" The tall blonde guy spoke next: \"I'm Darnell, but everyone just calls me Nells. I'm a senior, part of the Sigma Pi Fraternity, and a CS major. I do long and triple jump.\" The chiseled brown guy barely lets a second of silence go by before speaking, \"Yo, I'm Fernando Fitzgerald, Fitz. I'm a high jumper, but I also vault sometimes. I'm a junior in Robotics Engineering.\" \" I'm Nicole. Nikki. I'm a junior, Mechanical. High Jump and Long Jump.\" \" Andrew Boone. Bones. I'm a sophomore, I haven't declared, but am leaning towards Biomedical Engineering. Long Jump and the 100.\" \" Nadine Carlson. Just Nadine is fine. I do High Jump and Triple Jump. Sophomore, Physics.\" I'm next, but before I can speak, Michaela speaks up. \"You three are our newbies. Each of you are going to get one of us for a mentor. You know the big/little thing in sororities?\" We nod. \" One of us is going to be each of your big. We wanna see you jump. We're gonna ask you a bunch of questions, judge your fitness. Then we will chose one of you, each. Those of us who choose the same will decide which one gets you.\" \" Now introduce yourselves,\" says Nadine. \" I'm Ethan,\" I swallow. \"Carver. I prefer either E, or Carver. I'm gonna major in Aero/Astro. I'm a high jumper, mostly. I did the horizontals, but I'm not as good at them.\" \" I'm Emma! Emma Giles. I'm undeclared right now, but I'll either do Physics or Aero.\" \" Addison James. I do all the jumps. I'm double-majoring. Robotics Engineering and Biomed.\" Addison is from Choate, and he got twice the amount of interest as I did as a freshman, and it only got bigger. He cleared 7 feet halfway through senior year. \" Now run an easy 800!\" Michaela commanded. The three of us take the inner lanes and start to jog. They set a slightly faster pace than I normally warm up at. Still slightly winded from sprinting to practice, it's a bit of a struggle to keep up. The upperclassmen take position on the outer lanes and take it easy down the track. When we finish, we all stretch. \" Okay, go put on your spikes.\" While we're swapping our shoes, Fitz comes over. \"Hows your first day treatin' you?\" His voice is musical. I blink. \"Pretty well. I mean, I almost forgot about practice while playing frisbee. But it all seems pretty straightfohwahd.\" \" And your leg?\" \" Oh it hasn't been particularly painful since the end of sophomore year. But It's been harder to get its strength up than I had hoped.\" \" Um, well good luck on this.\" \" Uh, thanks.\" \" Alrighty, now. Vertical jumpers, let's go to the pit.\" We walk to the red mats. The upperclassmen remove the covering structure, and pull back the cover. They put up the standards, and place a bar over the mat. \"Dicky hates this.\" I hear Nadine whisper to Michaela. \" Okay, what are y'alls steps?\" Emma goes first, \"Eight, I jump righty.\" She stands in front of the mat, by the left mark on the bar. She bounces away, pushing forward. On her eighth step, she pushes up, and the rest of the team points where her foot landed. Someone put a piece of tape down. Then I go. \"I'm weird, nine, on my left.\" I burst away from the right side of the mat, counting aloud with each step as I accelerate away. Addison says \"You got a tape measure?\" Nells nods. \"Fourteen feet five out, another 65, two and a half back.\" They do out the measurements. \" Emma, we start at 4‘10 today.\" She nods, nervous. As she walks to her start, I pat her on the shoulder. \"You got this.\" Once she gets to her spot, she hops up twice before taking the starting position, her right foot in front. She takes three steps before beginning to curve around. Throwing her final step at the ground, she pops up and over the bar, barely clearing it. She rolls off the mat, placing her feet gingerly on the surface. \" Take your time. Next height is five feet even, unless you wanna skip it.\" \" No, I'm fine.\" She catches her breath, and runs around in a few tight circles before taking her starting point again. Two small hops, then she crouches again for the start. She clears the height again, but only after the bar kindly bounces up and down. She hit it. At 5‘2,\" she slips over the bar, leaving it quivering. \" Now 5‘4\". We're starting you guys next height, be ready.\" \" Can I skip it,\" asks Addison. \" Nope.\" Two more hops. This time Emma plows into the bar. \" Your up now, E!\" I take a deep breath. I stand on my mark. I touch my toes. I jump up and pike my legs. I do both again. I crouch over my leading right leg. One. I throw myself forward. Two. My other leg pushes off the ground. Three. One more push, accelerating. Four. Top speed. I pull my torso up, and lean. Five. I turn towards the mat. Six. More turning. Seven. I tense. Eight. Penultimate step. I drop my center. Nine. My left leg slams into the ground I lift in the air. My angular momentum spins me. I arch over the bar. Kick. My shoulders slam into the mat. \" Good,\" says Nells. \"Faster next time.\" Addison flies over the bar. No warmup, no ritual. They raise the bar. Addison passes. 5‘8 is the highest I'd jumped since my injury. I get ready. Bend, pike-jump. Bend, pike-jump. Crouch. Power. Turn. Penultimate. Jump. Arch. Kick. Land. 5‘10. Addison goes first. He clears easily. I start again. Ritual. Crouch. Run. PAIN ! I come up short, clutching my calf. I sit down. Everyone rushes over to me. \"You OK ?\" It's Bones. I shake my head. Michaela gestures to Nikki and Nels. \"Bring him to the trainers. They'll figure it out.\" \" But we aren't in season.\" \" He's part of a varsity team, they'll treat him.\" They grab a hand apiece and pull me up. Nells stands on my left, and bears the weight I'd put on my painful leg. Nikki helps on the right, supporting me between steps. We get to the bottom floor of the Gym, and they help me into the trainers' office. They help me onto a table. A trainer comes out. \"What happened?\" \" He came up short on an approach, the pain seems to be coming from his left calf.\" The trainer steps over to me. \"Where is the pain, exactly?\" I trace a line from my mid-calf to my knee, on the outside of my lower leg. He nods. He pulls out a roll of tape and applies it with with a deft hand. \"Don't put any weight on it outside of practice for a week. No running at greater than a jog, and only use treadmills or a bike for 30 minutes at most. Come in for heat before practice, at least 30 minutes. Then get ice after. We'll tell you when you can stop.\" I nod. \"How am I gonna keep from putting weight on my leg?\" As I expected, he pulls out a pair of crutches. \"These are your new best friends.\" He wraps some ice on my leg, taping it there, with a piece of paper towel between the baggies of ice and my skin. \" Now go and get some rest.\" I look to Nikki and Nells. \"I'm sorry.\" \" Go home. It's fine.\" I'd gotten used to crutches when I tore my quad, so I pick them up and start ambling back to my dorm. It takes a while. Limping around on crutches is much slower than sprinting at full tilt. It's fully dark by the time I get back to Falley Hall. I take the elevator up to the second floor. I see it all sprawled across the common room floor. All of my gear. Everything. \" Freak!\" \" Tranny!\" \" Pervert!\" \" Get out!\" I scream it at the top of my lungs. \"Fuck off!\" I brandish a crutch. Something in my eyes, or maybe just the five foot long piece of aluminum flailing around scared them enough to get them away. I gather everything up, tears welling in my eyes. It takes two trips. I'm ignoring the orders of the trainers, leaving my crutches leaning against the wall of the common room while I hobble around, picking up all of my stuff, and returning it to its proper location in my own room in the tower. It's slow, and it's painful work. Once I put the last of it away, I grab my crutches, bring them back, and collapse onto my bed, tears flowing freely now. KNOCK ! Someone is at the door. \"Carver? You OK ?\" It was Diane's voice. I wiped at my face. \"Yeah.\" It sounded anything but sincere. \"The door's unlocked. Come in.\" \" Sure.\" She steps through the door, seeing me curled up on my bed. \"I'm sorry,\" she says. \"I should have stopped it.\" \" You could have? Who did this?\" \" A couple of people down the other end of the hall. They're buttholes.\" She pulls out my desk chair and sits next to the bed. Her eyes fall on my taped and iced leg. \"Oof. That doesn't look good.\" \" Yeah, I fucked up my ankle in the first captain's practice. What a first day, amiright?\" My smile doesn't come close to reaching my ears, my heart not really in the expression. \" Wow. I'd almost say that the ISTU is out to get you.\" \" Nah. People just suck. And I'm prone to injury.\" I shrug. \"I'll be okay tomorrow, and I'll be walking unassisted by the end of the week.\" She narrows her eyes. \"Fuck that. No one is okay eight hours after that . It's going to take more than just a bit of sleep.\" \" I could go for a nostalgic Disney movie right about now.\" The smile is a little more real this time. She laughs. \"When aren't people up for Disney? Just us, or do you think that the rest of the suite should join up?\" \" Ummm…\" I languish for a second, \"everyone. Why not? It's not like they were the asshats that went through my stuff.\" She grimaces a bit. \"So what movie do you think? Leelo and Stitch ? The Hunchback of Notre Dame ? The Emperor's New Groove ? Frozen ?\" She chuckles. \"I'm kidding. Or is there something else?\" \" Let's go with Hunchback .\" \" Yo,\" she yells out the door. \"Who's up for watching The Hunchback of Notre Dame as a suite tonight?\" Voices respond affirmatively, and we go to the common room and hook a Netflix account up to the TV . Captains' Practice Playlist After the disaster that was Carver's day at the ITSU , the playlist for the night definitely reflects their crappy mood. Halestorm starts the night off, a staple in Carver's playlists since high school. Number Song Title Artist 1 I Miss the Misery Halestorm 2 Set Me on Fire Flyleaf 3 Let Me Live My Life Saint Asonia 4 Our Own House MisterWives ISTU Track Team Overview The ISTU track team is, in the scheme of New England DIII schools, actually pretty good. Led by the strength of their throwers—mostly Air Force ROTC cadets—they do pretty well in a number of post-season meets. However, they are quite small in comparison to a number of other local schools, with a team of only 60 people. Coached by Mildred Vass, a former Javelin star for UT -Irvine, the team often has to compete for practice space with both varsity sports and clubs of all sorts. The team: Distance/ XC —Coach: James Little (24) Captain: Sr Lauren McBride Star: Fr Carmen Vane Star: So Mark Curry Sprints/Pole Vault—Coach: Yvonne Kass (3 Vault, 11 Sprint) Captain: Sr Sergio Blair (Vault) Star: Ju Kim Collins (Sprints) Javelin/Multis—Coach: Cassie Stevenson (2) Captain: Ju Alma Chandler (Multis) So Walter Estrada (Javelin) Jumps—Coach: Richard Spear (9) Captain: Sr Michaela Cross Sr Darnell Brown Ju Fernando Fitzgerald Ju Nicole Farmer So Andrew Boone So Nadine Carlson Fr E. Carver Fr Emma Giles Fr Addison James Throws—Coach: Lyles Starr (11) Captain: Ju Susie Dean Star: Sr Blake Jimenez Star: Fr Desiree Hudson Star: So Jack Hughes","tags":"The Penultimate Step","url":"fightfil.github.io/tps-chapter-2.html"},{"title":"TPS - Chapter 1","text":"The auditorium's simple doors belie the enormity of the chamber they conceal. The ever-painful Hartford traffic made me a tad late, so I enter the hall already full, the stadium seating already containing hundreds of parents, dozens of professors and staff, and even a smattering of returning students. A giant sign points to where the freshman are sitting—on the stage. There is nary an empty seat left. But I find a chair, between a lean, springy-looking, guy and a chick whose flowing mane puts even lions to shame. As my backside lands on the hard plastic, the loudspeakers crackle to life: Welcome, class of 2020, to the Igor Sikorski Technical Institute! Some of the most important years of your life are beginning, and we are thrilled that you have chosen to come here to spend them! You are participating in a tradition of excellence that is as strong as you'll find anywhere, even if it is younger than many of the other schools that you might also have considered. The speck of a woman standing at the podium, giving the freshman class its welcoming address, is Dr. Emma Culpek, the school's President: she was on the team at SpaceX that developed reusable rockets before she joined the school this summer. You haven't quite made it to real life yet, but for most of you this will be your last stop before you get a job, start your career, and begin to change the world. In just four short years, many of you will be working with the most cutting edge technologies and research in the world. You all will have learned more than any of us have ever known, and the world shall belong to you. As I speak, returning students are helping your parents put all of your stuff in your rooms and when we are done here, you will be able to start getting to know everyone. But in the meantime, we will be going over a few of the less fun aspects of starting college. We will discuss rules and logistics before handing things over to your First-Year Experience Advisors, your FXA 's. Tedium engulfs the room. For the next 80 minutes, stuffy lecturer after stuffy lecturer graces our privileged asses by spelling out how, exactly, we will be enjoying our time at the ISTU . Not like we haven't researched everything to do with this place while agonizing over which school to go to or anything. Not even the inevitable snickering and whispered conversation can break the monotony of Dean after Dean giving endless tips about how to go about studying, why torrenting is a Bad Idea © , or how to Enjoy Yourself at a Party Without Drinking™ . Slowly, agonizingly, the presentations draw to a close. The auditorium doors swing open, our portal into this new world of college life, once step away from the Real World ® . As we step out into the sun, heat bearing down on us, our path to freedom is blocked by a dozen or so tables, each sporting a letter or two. A girl in a sorority shirt—Alpha Xi Delta—stands in front of them with a megaphone. \"Go to the table with the first letter of your last name! Pick up your keys and ID 's!.\" She repeats that ad nauseum—she'll lose her voice before the day is out. \" Ethan\" *cringe* \"Cahvah,\" I say, once I've reached my table. \" ID number 443455432.\" \" Wow,\" the table-sitter says, \"you've memorized your ID already. That'll come in handy. But I just needed your name. Let me see here,\" she's ruffling through a box of small envelopes. \"Here we are. Your ID is in here, along with the key to your room. It's in Falley Hall, 201 D. It's on the east end, a room in one of the tower suites.\" \" Cool,\" I say, lacking any more articulate a response. Grabbing the envelope, I start off to my dorm. Of course, I have no idea where I'm going, so I stop at the campus map first. It's conveniently located just outside of the auditorium parking lot. Falley Hall is pretty close, just on the South Campus. I set back off towards it. Being move-in day, all the doors are wide open and I don't yet need my ID or keys to get in, so I stride right through the door, down the hall, and up the staircase. Falley Hall is mildly castle-like, flanked by octagonal towers that extend a story above the rest of the building. My tower is on the side closer to the lake, so once I find myself on the second floor, I step in. The common area isn't large, just enough for a couch and TV , but it's separate from the rest of the dorm. I see my door, ‘D', so I step in. All of my stuff is stacked neatly beside the bed. I got the single that I wanted so badly, so I wouldn't need to negotiate anything with a roommate. My computer bag is on top, so I swing that over to my desk. I pull it out: The IT director showed us how to connect to the network during the presentations, so at least it that hour wouldn't go entirely to waste. \" Yo! E'rybodayyy!\" The voice booms from down the hall, exuberant and bouncy. \"Ya'll need to come out and come to the First Year Barbecue. All y'all will be sitting with your neighbors and gettin' ta know each otha'.\" I stick my head out the door, looking to get what was going on out in the hall. My room is angled in such a way that I can see little from there, so I head back out. Standing in the middle of the hallway, clad in a baggy neon shirt emblazoned, in two rows of letters, with ITSU FXA on its chest, is Howard Lyons. I remember him from my recruitment visit last winter, while I was still deciding which school I'd choose. \" Howard?\" I say, doubtful he'd remember me . \" If it ain't the washed-up wonda! What's new, Carver.\" Oh God, I almost forgot about that nickname . I had gotten it when I tore my quad after a couple years of really promising performances in high school. I was getting real interest from some DI schools back then. But I never came back the same. I really was a ‘washed-up wonder'. But self-pity gets me nowhere, so I focus on the conversation that I am supposed to be having: \"Well, I'm happy to finally be here. It's really surreal. I think I'm still riding the high of graduating.\" \" I know that feel. It may have been three years ago, but I don't think I'll ever forget graduation. Now get'chyo' ass over to the barbecue.\" Instinctively, I hop to it. There's something about instructions from experienced athletes that just makes me act without hesitation or question. Or you might have a thing for him. No I don't have a thing for him. He's too chunky—too much of a hunk . The quad is a sea of umbrellaed tables: each one emblazoned with the crest of one or another of the freshman dorms. Falley Hall's is fairly simple: a computer on a shield. The style of computer indicates the floor. The second floor gets the late-nineties kind: a beige tower along with one of the old tube displays. 1 I find a table with one of the nineties-style computers on the umbrella and sit down. Moments later, a short red-headed guy walks up: \"Do ya mind if I sit here?\" \" Nope. There's more than enough room here. I'm Ethan, but ever since I had a class with 5 other Ethan's in it, I've gotten into the habit of just using my last name: Cahvah.\" \" Carver?\" \" Ayuh.\" \" Nice to meet you. I'm Kyle Talbott.\" \" That name rings a bell.\" I remember reading the name before—on the email that told us our room assignments during the summer. \"Oh! You're in my suite!\" \" So that's why Howard was enthusiastically steering me this direction.\" \" Probs. He's a bit exuberant.\" Just as we are getting comfortable around each other, another new face butts in. \"Hiya!\" She is tall—taller than me—with flowing golden hair, and a smile that could warm even the coldest days. \"I'm Diane Mesker. Howard told me to go here. Though his exact words were something more like: See that table with the chubby red-head and the string-bean? I better not see your ass anywhere else.\" \" ‘Ass' is his favorite word. I'm Ethan Carver ,\" this time I take extra care to enunciate the ‘r's, \"Though I tend not to use ‘Ethan' much.\" \" And I'm Kyle Talbott. I just go by Kyle.\" \" Ha. ‘K. Kyle and Carver. Got it. \" So where are you all from?\" This is Kyle, for the record. \"I was born in Sturbridge, but my family moved to Boulder, Colorado, before I started high school.\" \" Born and raised in Rockport, Maine,\" I say, \"the only town in the state to have residential fiber internet.\" \" Never heard of it.\" That voice is new. We all turn, a tiny bit startled, to see a new guy standing just behind Kyle. \"Yo,\" He says. \"I'm Theo. …Welk. I'm from Stamford. I think I'm rooming with you, Kyle.\" \" Oh, really? So that Stratocaster is yours? Man, that thing is sweet!.\" \" Thanks.\" He isn't particularly enthusiastic about the praise. But before an awkward silence can fall, he turns to Diane, \"And are you Jen or Diane?\" \" I'm Diane, and before you butted in, I was gonna say that I'm from Glastonbury, and I'm here with my twin sister, who is staying in Kepler.\" \" Ooh, fancy. I'm Ethan Carver, by the way, in case you haven't guessed. But call me Carver, please. I got used to it in high school and I don't know, I just like it better.\" \" Why don't we sit?\" says Kyle, acting the pragmatist. Diane and I sigh, happy that we don't have to be the ones to suggest it. We all turn to face our chairs, meaning to sit down, and see that someone sat at the table while we were talking. \" Hi guys,\" Her voice barely penetrates the low din of the dozens of surrounding conversations. \"I'm Jen. I'm from Poughkeepsie—my mom teaches at Marist.\" \" Wow, good job sneaking up on us,\" says Theo. \"We didn't even know you were there.\" \" Yeah, sorry.\" All sitting now, I try to continue breaking the ice. \"Does everyone know what they'll major in?\" Diane barely waits for me to finish the question. \"Robotics, with a biotech focus.\" Theo is also pretty quick to answer. \"Computer Science, definitely, but I don't know if I want to focus in Robotics, or AI , or even Physics.\" \" I'm going to do Aero/Astro and focus on Physics, with a minor in Lit.\" \" Fancy…\" This is Kyle. \"I'm going to do a double major, Electrical Engineering, and Chemistry. Their focuses are each other, so that's fun. And I think I'm gonna get a Theatre minor, and maybe also do something with Math.\" \" Who's fancy, now?\" I retort. \"So tell me all about this life that you are never gonna have.\" \" Hey!\" \" What about you, Jen?\" asks Diane. \" Oh, I'm still deciding. This term, I'm taking a bit of everything—Data Structures, ODE 's, Intermediate Mechanics, and Intermediate Genetics.\" \" Fuck.\" Theo receives a few glances. \"Those are hard classes. I'm not even gonna be able to take Data Structures until the third trimester.\" Jen's lips twitch, the faintest hint of a smile gracing her face. ODE 's? I might have that class with her! \" Who do you have for Differential Equations? We might be in the same class.\" \" Renler, I think. At 2 on Mondays, Wednesdays, and Fridays?\" \" Ayup! Wicked. I won't be totally alone in theah then.\" \" What classes is everyone else taking?\", Jen asks, \"Maybe we all won't be alone.\" \" Well besides ODE 's,\" I start, \"I'm taking German I, Early Speculative Fiction, and Stress Analysis.\" \" There's only the one intro German class, right?\" Asks Theo—when I nod, he says, \"So we'll be together for that. I'm in Introductory Programming, Calculus 2, and Technical Writing I as well.\" Kyle lights up at the last two: \"I'm in Calc 2 and Technical Writing too. I'm also taking Introductory Electricity and Magnetism and Chem 2.\" \" What about you, Diane, are you in any of our classes?\" \" No. I'm in Calculus 3, Intro to Robotics, Biology 2, and Music Composition I\" \" Um, guys, I think we've been missing out on the food—see all those dudes with their plates piled high food?\" Theo finally brings us all back to the main purpose of this gathering—the BBQ . We all get up—Theo leads the pack at a brisk walk, letting no one get in between him and his food. It's standard barbecue fare: burgers, corn, melon, chips, ect. Before to long, we're back at our table, chowing down. \" So you play guitar?\" Diane asks Theo, starting the conversations back up. \" Yeah. Well…\" He doesn't look enthused about talking about his musical past. \"I was in a band in high school. We even toured around a bit. But the rest of the band chose to go to UCLA for college, while I was left alone going here. They kinda abandoned me, so it's been hard to stay interested in playing.\" \" That sucks. I sing a little and have a bit of experience with a couple instruments, so if you ever wanna jam…\" \" Sure. So what will the rest of you be doing when you aren't ‘hard at work'.\" Diane and I speak almost at once: \"Basketball.\" \"Track.\" Jen says, \"I'll probably destroy my free time with theatre!\" My brain immediately envisions the girl whispering her way through the \"O, what a noble mind\" soliloquy. I banish the unfair imagery and ask, \"Musical theatre, or plays, or do you do tech?\" \" I love me some musical theatre. But I also do a lot of stage design and building for tech.\" \" What about you, Kyle.\" \" I, uh, play video games.\" He looks seriously intimidated by all of our well-lain-out plans for extracurricular activities. \"and I am a big pen and paper nerd. I've been known to GM a game or two before.\" \" Which games do you do?\" Asks Jen. Please don't be lame and just say D&D \"Well, I've kinda gotten tired of the more mainstream ones like D&D or Warbane 2 ,so now, I mostly homebrew, but I recently tried Mind Phase , which is pretty good.\" The average observer might not recognize it, but upon hearing the words Mind Phase , something clicks in our group. Each of us perk up at the mention of the game. It's a cyberpunk RPG system with a lot of really good mechanics for dozens of Sci-Fi tropes 3 . We all blurt, \"We need a campaign of this,\" at once. \" You've heard of it?\" Kyle was incredulous at us—jocks and theatre and band geeks—being in to the pen-and-paper scene at all. Jen nodded—almost sagely, \"I was at the con where Pascal and Yates unveiled it. My mum got to playtest it—she loved it.\" \" Well we know what we're going to be doing in whatever free time we have, then,\" I say, excited now. \" Definitely,\" says Kyle. \"But I'm going to have to spend a while to get a campaign ready. We'd to have a real universe built up before there'd be any hope of a great campaign.\" \" Ooh, I love world-building.\" Theo's lips finally broke into a smile—making me realize that he had not yet done so throughout our whole meal. \" Then you should definitely give me a hand,\" says Kyle, who appeared to also take note of Theo's demeanor. Noticing that our plates were quickly emptying, I ask, \"Does anyone remember what we are scheduled to do after this? I only barely read the schedule in the first place.\" \" Um, chill?\" Kyle's voice is hopeful—he hasn't a clue. \" I think we have department presentations next,\" Theo suggests. \" Yeah, after those, we can meet up for dinner?\" Jen's cheeks flush a little. \" Totes,\" answers Diane. Getting up, we bring our plates to the trash and head our separate ways. Freshman Orientation Playlist Carver's playlist for Freshman Orientation is as follows. One of their friends from high school, Kels, sent them the Flyleaf related songs ( Something Better , Impossible , and Parachute ), while Make a Shadow and Hard Came the Rain were from artists recommended by Jen once they got back to the dorm that evening. Number Song Title Artist 1 Make A Shadow Meg Meyers 2 Something Better Flyleaf feat. Sonny Sandoval 3 Hard Came the Rain Rag'n'Bone Man 4 Impossible Lacey Sturm 5 Parachute Kristen May The first floor gets an early eighties style terminal computer. 3 rd floor gets a laptop, while the 4 th floor (just the towers) are either represented by a punch card or a tablet. ↩ I will be coming up with parody names for games and some other stuff. Not for any particular reason—you may have noticed I'm not changing the names of companies like United Technologies, Sikorski Aircraft, or SpaceX—but so that there is a personal flair to the world. I guess it is also so that if I put actual gameplay in the story, people won't be like \"That's not how it's played\", or something. Thus, I introduce you to Warbane, a parody of the Warhammer universe of games. ↩ This is a fictional system loosely based off of a (made-up) hybridization of Mindjammer (by Sarah Newton) and Eclipse Phase . Both are good role-playing systems in their own rite, but they are somewhat similar in scope, and have some shortcomings. However, those shortcomings are different and each game's weaknesses are strengths in the other one, so I may try to formalize this said system. ↩","tags":"The Penultimate Step","url":"fightfil.github.io/tps-chapter-1.html"},{"title":"TPS - Prologue","text":"\" What are you doing, Carver?\" \" You'll find out. Don't worry about it.\" Everything is lain out before me: my robe, my mortar board, and my implements of re-invention. Of course, those are covered, hidden from the prying eyes of my roommate. It won't do to reveal any secrets prematurely. Today, I adhere to Shakespeare's ideology: the world is my stage, and I am merely a player. And as such, I must follow the rules of drama. Everything must build to the climax, and at the height of the drama, only then can secrets be truly revealed, can the plot be resolved. The past four years have been building to this one moment—this is the climax of this chapter of our life. \" Remember, we all have to be ready to march at 11.\" \" I know, Gregory. I'm practically running this, remember?\" He rolls his eyes at me, \"Whatever. Just don't piss of the headmaster on your last day.\" \" Hey, there's no better way to end your high school career.\" Shaking his head, he leaves the room. With him gone, I get to work. \" Are you sure you are allowed to do that to your graduation robes?\" \" I'm only making minor modifications.\" \" Minor? You're turning it into a gown!\" \" That is the point, Jesse.\" \" You sure you aren't going to get into trouble for this?\" \" Nope! But, honestly, I don't care. As soon as I came up with the idea, I knew that I had to do this, no matter the consequences. I have to do it for me.\" \" OK . Just don't get expelled on the day of graduation.\" \" Phhbt, like they're gonna expel me.\" They're gonna expel me . \" I'm done with your mortar board.\" \" Thanks, Kels.\" I think that's everything. \"Wish me luck.\" This is going to be a disaster. Kels literally jumps on me, squeezing me in the tightest hug her tiny frame allows. \"Kill ‘em.\" \" You're going to give them a speech they'll remember for the rest of their lives, Carver.\" That's what I'm afraid of. I put the little one down, extricating myself from her tiny limbs. \"I'm gonna miss you guys.\" They both come in for the hug this time. \"Fuck you for leaving us.\" \" Who is that?\" \" Is she a dude?\" \" What did they do to the graduation robes? Are we allowed to do that?\" Breathe… Ignore them. \" Graduates, line up.\" I take my place at the lead of my line. \" That's Carver?\" \" What's he doing all made up like a girl?\" The orchestra started playing—Pomp and Circumstance and we stepped down the aisle. The whispers start again, this time from the gathered onlookers—family and friends of the other graduates. I draw into myself. They think you're a freak. You are a freak. We file in amongst the seats, standing in front of our chairs. The headmaster steps to the podium. \"Welcome to commencement 2016! Graduates: congratulations. You've accomplished one of the most important milestones of your young lives. I see many younger students here, welcome! You all are well on your way to standing in the place of these fine young men and women. I see some alumni as well: welcome back! I'm happy you all can join us to welcome our graduates into the folds of adulthood. I see parents, grandparents, aunts and uncles, cousins, brothers and sisters. Welcome too! Thank you for spending so much of your time, energy and money to helping raise such a great collection of young adults. \" I'm sure you're all excited to actually graduate, sooner rather than later, so lets get right into it. Over the past two, three, and four years, I have gotten to know all of you, I've seen you all come in as children, and grow up unbelievably quickly. You all have packed so much into your short time here. \" You've built robots, written and produced plays, conducted philosophical debates, created viral applications, designed offshore wind platforms, published in peer-reviewed journals, competed in national athletic and intellectual competitions, and are headed to some of the most prestigious, rigorous, and well-respected universities in the world. In short, you have all grown up wonderfully and we are all proud of each of you. \" You are going to be a part of a generation that will oversee such drastic changes to our world that I can't even begin to predict any of the challenges that you all will encounter. But, thankfully, our commencement speaker, this year is Dr. Lillian Holbrook, the CEO of Kelmer International, a venture capital firm where it is her business to understand how the world is going to change, and how best to prepare for it. \" Lillian?\" \" Thank you, Dr. Holbrook. Now I am happy to introduce to you someone that you all know and love, your own senior speaker: Ethan Carver!\" Holy fuck, this is really happening! I fail to banish the nerves from my face, but I stand, and walk up to the podium. I hear the whispers start again, but they don't matter anymore. \" Thanks so much for being here, everyone. I know, firsthand how hard it has been for all of you to come from around the country and world to help us celebrate. Even though my parents couldn't make it all of the way here in time for this, it means so much to me, to all of us, to have you, our friends, family, loved ones, to come and be here with us as we journey on to the next chapter of our lives. Because, as both Professor Kirk and Doctor Holbrook were saying, none of us know what the future brings. \" You all have made it possible for the last two, three, and four years of our lives to take the shape that they have, to put us in a community like this one where even though my parents aren't able to be here, I still feel like I am surrounded by family. \" Four years ago, I was a stranger in a strange land. It was the first time I had ever left my home state of Maine, after living in a small coastal town my entire life. And here I was, not yet 14 and completely alone, terrified by this new experience with new classmates, new teachers, and a whole new atmosphere. \" That feels like forever ago now. Our lives here, though the time they've taken is very finite, only a couple of years, feels undetermined, without beginning. I think that speaks to the kind of place, people, and community that is here. Every year, sixty or so total strangers step through those gates for the first time, alone and terrified like me, like each of you. But only a few weeks later, we are calling this place home . \" We are all incredibly lucky to have found this wonderful community, a place where each of us can say that we belong. But this community doesn't just exist, no. It's taken effort from each of us, every single day. We are the nerds, the geeks, the oddballs, the ‘smart kids', the weirdos, and many other things that, where we all came from, were ostracized, shunned, or otherwise made to feel unwelcome. But here, we all accept everyone as they are, and I think that's what makes this community special. \" Each one of us knows what it feels like to not fit in, so we've built a community where everyone feels safe, feels welcome, and doesn't feel judged. This school has become our safe space. Everyone feels safe enough to be their selves and we've peeled away those outer, unhealthy layers of our shells. \" Of course, that has exposed our vulnerabilities to each other—by being true to ourselves, we have put ourselves at risk among one another. But we've built a strong bond, and no one has ever betrayed that trust. So we all have emerged, better than when we arrived. \" But even that safe space isn't always enough to allow someone to truly come out of their shells. That trust we have in each other can also be a barrier. As we've revealed ourselves to each other—even more than we even knew about who we are—there are some things that we've discovered about ourselves that might not match up with the personas we've cultivated here. \" But—you might interject—aren't we being true to ourselves here, how can we present a persona, aren't personas fake personalities? We are being far more truthful in our personalties here. We do show aspects of our personality that we've kept suppressed at home, at our sending schools, but even then, there are aspects that we've kept hidden. Aspects that feel contradictory to those we've first presented here, ones that add depth and layers to our lives that we aren't ready to deal with. \" So we've hidden even those. And for the most part, that is healthy. We shouldn't know every little thing about each other—imagine all of the embarrassing things that would cause. But sometimes there are things that eat us from the inside, things that we want to share, but are still afraid too. These are the most dangerous. \" These are the secrets that end relationships, that end lives. These secrets often don't come out without help. They terrify their holders just like Exeter terrified us when we first arrived. They poison us, but we are too afraid to share them not because we are afraid of each other, but because we fear our own truths. \" Today, I am using this speech to expose one of those truths about myself. This one has eaten me for a long while now, and it wasn't until this spring that I was able to open up about it to anyone. \" Yes this is the moment where I tell you why I disfigured my robe—why I've chosen to graduate looking like this . \" How many of you all fall under the LGBTQIA -plus umbrella? It's far higher than the statistics for the world at large would suggest. This, I believe, is a result of the community we've built. The tradition of tolerance that we carry on has attracted us here, where we know we will be welcomed, regardless of our identity or sexuality. \" Almost all of you know that I am bisexual. It's never been a secret for me. But what almost all of you don't know—never would have known if I hadn't felt at home enough to tell my truth, is that I am also transgender. By sophomore year, I had begun to understand one of the things that made it so difficult for me to really integrate into a community—since I had a so much difficulty accepting myself. \" I'd realised that I had been born with a body that didn't reflect the way I was wired. My body was being flooded with hormones that affected my life in ways that felt totally foreign to me. I was seeing others, you girls, getting the changes that would have felt at home on me, while instead, I was becoming like you men, no offense. \" But I was afraid of this feeling. I worried that it was some weird fetish, or that I was a freak, or that I just hated myself, and this was my mind's way of presenting that. So I hid it. From you, from her, from him, from me. \" But I stepped out of our safe zone this past summer, when I went to a NASA summer camp. The change in atmosphere helped push that feeling back to the forefront. So I was battling it through the beginning of this year. \" Then I come back here. I make friends with a couple sophomores, who had just started here—some of those terrified strangers. Together, we brought each other's secrets into the light, pushing us to break out of our shells. We were happier—healthier—than we'd ever been before. \" Now here I am, telling this truth to you, freeing myself from this secret that almost destroyed me. These past 4 years have never been easy, but together, we've gotten through them. And for that, you all will always be just as much my family as my parents. \" Our community will survive, though we will be scattered across the world, not by being anchored to our old selves, even the ones we found here, but by always continuing our journeys of self-discovery and by helping others do the same. For in this unknown world we are about to enter, we should be defined not by who we are, but by what we help others become.\" Graduation Playlist So for each chapter, I will post a playlist of all the music that Carver is listening to. It's an important part of her character, and helps me understand her personality through her music tastes. I'd try to describe those tastes here, but it's not really a thing that I can fully capture in just a few sentences. I'm not even sure what those tastes are, but every so often, I'll come across a song that I know she has definitely been listening the shit out of. Because she doesn't like listen to a huge variety of songs constantly—she tends to focus on a single album, or even a single song, and listen to it until she hates it. During sophomore year of high school, she was at her worst. She listened to a total of 17 songs all year. But after mentioning it off-hand at the summer camp she was attending, her friends tend to send her albums and mixtapes in order to try to vary it up for her (though all those people know Carver with male pronouns). But enough of my rambling about the characters—you'll get tired of that between updates so I don't need to make you listen to that during them. So here's the playlist: Number Song Title Artist 1 Raise Hell Dorothy 2 Hardly Hardly Wallis Bird 3 You're A Runner Me And My Drummer 4 Beautifully Jay Brannan 5 Sky in Your Bones Tutile 6 Unfinished Memories Eowyn 7 Sirens Fleurie And that's it. This was Carver's playlist for finals week, the buildup to graduation, and packing up after graduating. Raise Hell was a single for the Dorothy album ROCKISDEAD , released on June 24, about a month after graduation, so you know that's what she listened to all summer. It's good.","tags":"The Penultimate Step","url":"fightfil.github.io/tps-prologue.html"}]}